chatbotstudios/mini_v1/sdkconfig.defaults

# Bluetooth (NimBLE)
# CPU 240MHz
# Console/UART for CLI
# Custom partition table
# ESP32-S3 Octal SPIRAM Stability
# Flash 8MB + QIO
# MimiClaw - Common Default Configuration
# MimiClaw - ESP32-S3 Target Configuration
# PSRAM 8MB Octal
# TLS Insecure flags for API endpoints
# TLS optimization (PSRAM allocation + small buffers)
# Target-specific settings are in sdkconfig.defaults.esp32s3
# WebSocket support
# WiFi memory optimization
CONFIG_BT_CTRL_LOG_SPI_AND_QSPI_BUS_CONFLICT_WILL_CAUSE_PANIC=y
CONFIG_BT_CTRL_PINNED_TO_CORE_0=y
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=3
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_INTERNAL=y
CONFIG_BT_NIMBLE_PINNED_TO_CORE_0=y
CONFIG_BT_NIMBLE_SVC_GAP_DEVICE_NAME="MimiClaw-S3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_TLS_INSECURE=y
CONFIG_ESP_TLS_SKIP_SERVER_CERT_VERIFY=y
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_RX_BA_WIN=3
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=3
CONFIG_HTTPD_WS_SUPPORT=y
CONFIG_IDF_TARGET="esp32s3"
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=16
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_HARDWARE_AES=n
CONFIG_LV_FONT_FMT_TXT_LARGE=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_8mb.csv"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=256
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=131072
CONFIG_SPIRAM_MEMTEST=n
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIFFS_OBJ_NAME_LEN=64
CONFIG_PM_ENABLE=n
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y

# LVGL File System and Images
CONFIG_LV_USE_FS_POSIX=y
CONFIG_LV_FS_POSIX_LETTER=83
CONFIG_LV_USE_TJPGD=y
CONFIG_LV_USE_FS_MEMFS=y
CONFIG_LV_FS_MEMFS_LETTER=77
CONFIG_LV_USE_BUILTIN_MALLOC=n
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_CACHE_DEF_SIZE=4194304
CONFIG_LV_IMAGE_HEADER_CACHE_DEF_CNT=8
CONFIG_FATFS_LFN_HEAP=y
CONFIG_LV_USE_LODEPNG=y
